package ru.gb.istomin.homework2;

public class FourthTaskHW2 {
    public static void main(String[] args) {
                textAndNumber("Heiio world!", 7);
    }
    public static void textAndNumber(String text, int number){
        int x;
        for (x = 0; x < number; x++){
            System.out.println(text);
        }
             }
}
/*Написать метод, которому в качестве аргументов передается строка и число, метод должен
отпечатать в консоль указанную строку, указанное количество раз*/